Repository: github138/opsi-FreeBSD-ports
Catalog: opsi-atftp/atftp-0.7.dfsg/debian/po/*.po
Languages: de, fr

source: Do you want to configure the server?
de: Wollen Sie den Server konfigurieren?
fr: Désirez-vous configurer le serveur ?

source: atftpd can have various parameters passed to it. These parameters can optimize performances for servers that do heavy work. The default values are suitable for most purposes.
de: atftpd kann mit verschiedenen Parametern gestartet werden. Diese Parameter können die Leistung intensiv genutzter Server erhöhen. Die Standartwerte sind für die meisten Anwendungsgebiete geeignet.
fr: Atftpd peut recevoir des paramètres variés. Il est possible d'optimiser les performances en modifiant ces paramètres pour des serveurs effectuant des tâches lourdes. Dans la plupart des cas, les valeurs par défaut sont largement suffisantes.

source: Should the server be started by inetd?
de: Soll der Server von inetd gestartet werden?
fr: Doit-on démarrer le serveur par inetd ?

source: atftpd can be started by the inetd superserver or as a daemon and handle incoming connections by itself. The latter is only recommend for very high usage server.
de: atftpd kann durch den inetd Hauptserver oder als 'Daemon' gestartet werden und selbst externe Verbindungsaufnahmen verwalten. Letzteres ist nur bei sehr stark genutzten Servern empfehlenswert.
fr: Atftpd peut être démarré par le super-serveur inetd ou en serveur indépendant qui gère lui-même les connexions entrantes. Ce dernier mode n'est recommandé que pour les serveurs fortement sollicités.

source: Server timeout.
fr: Délais du serveur.

source: How many seconds the main thread waits before exiting.
de: Die Zeit in Sekunden, die der Hauptprozess vor dem Beenden abwartet.
fr: Combien de secondes la connexion principale est-elle maintenue avant de s'interrompre ?

source: Retry timeout.
fr: Délais de relance.

source: How many seconds to wait for a reply before retransmitting a packet.
de: Die Zeit in Sekunden, die der Server verstreichen lässt, bevor das zuletzt gesendete Paket erneut übertragen wird
fr: Combien de secondes faut-il attendre une réponse avant de retransmettre un paquet ?

source: Maximum number of threads.
de: Maximale Anzahl von Prozessen.
fr: Nombre maximal de connexions.

source: Maximum number of concurrent threads that can be running.
de: Die maximale Anzahl gleichzeitig erlaubter Prozesse.
fr: Nombre maximal de connexions simultanées.

source: Verbosity level.
de: Niveau der Redseligkeit.
fr: Niveau des informations souhaitées

source: Level of logging. 7 logs everything including debug logs. 1 will log only the system critical logs. 5 (LOG_NOTICE) is the default value.
de: Intensität des Loggens. 7 loggt alles inklusive der 'debug' Meldungen. 1 loggt lediglich die systemkritischen Meldungen. 5 {LOG_NOTICE} ist der Standartwert.
fr: Niveau en dessous duquel l'information est enregistrée dans les journaux. 7 enregistre l'information de déboguage. 1 n'enregistre que les informations critiques. La valeur par défaut est 5 (LOG_NOTICE).

source: Enable 'timeout' support
de: Aktivieren der 'timeout' Unterstützung
fr: Activer le support « timeout »

source: Enable 'tsize' support
de: Aktivieren der 'tsize' Unterstützung
fr: Activer le support « tsize »

source: Enable 'block size' support
de: Aktivieren der 'block size' Unterstützung
fr: Activer le support « block size »

source: Enable 'multicast' support
de: Aktivieren der 'multicast' Unterstützung
fr: Activer le support « multicast »

source: Port to listen for tftp request
de: Port, der auf eine tftp Anfrage überwacht wird
fr: Port d'écoute pour les requêtes tftp

source: Port range for multicast file transfer
de: Portbereich für 'multicast' Dateitransfers
fr: Intervalle des ports pour le transfert de fichiers en multidiffusion

source: Multicast transfer will use any available port in a given set. For example, "2000-2003, 3000" allow atftpd to use port 2000 to 2003 and 3000.
de: 'Multicast' Transfers werden jeden verfügbaren Port aus der angegebenen Auswahl verwenden. Die Angabe "2000-2003, 3000" erlaubt atftpd beispielsweise, die Ports 2000 bis 2003 sowie 3000 zu benutzen.
fr: Le transfert de fichiers en multidiffusion (« multicast ») utilisera tout port disponible d'un ensemble donné. Par exemple, « 2000-2003, 3000 » permet à atftpd d'utiliser les ports 2000 à 2003 et 3000.

source: Address range for multicast transfer
de: Adressbereich für den 'multicast' Transfer
fr: Intervalle d'adresses pour le transfert en multidiffusion

source: Multicast transfer will use any available addresses from a given set of addresses. Syntax is "a.b.c.d-d,a.b.c.d,..."
de: 'Multicast' Transfers werden jede verfügbare Adresse aus einer vorgegebenen Auswahl verwenden. Die Syntax lautet "a.b.c.d-d,a.b.c.d,..."
fr: Le transfert en multidiffusion va utiliser n'importe quelle adresse disponible d'un ensemble donné. La syntaxe est « a.b.c.d-d,a.b.c.d,... »

source: Log to file instead of syslog?
de: In eine Datei anstatt in das syslog schreiben?
fr: Enregistrer les messages dans un fichier à la place de syslog ?

source: If your server does intensive tftp file serving, it is a good idea to say yes. That will avoid to clutter your syslog with tftpd logs.
de: Falls Ihr Server intensiv zur tftp Bereitstellung von Dateien genutzt wird, so ist es eine gute Idee, hier mit Ja zu antworten. Dies wird es vermeiden, Ihr syslog mit tftp Meldungen zuzumüllen.
fr: Si votre serveur est utilisé intensivement comme serveur tftp, il est conseillé de dire « Yes ». Ceci évitera d'encombrer le journal syslog avec les journaux tftpd.

source: Log file.
de: Logdatei.
fr: Fichier des journaux

source: A file where atftpd write its logs. This file will be made writable for the user 'nobody' and group 'nogroup'.
de: Eine Datei, in die atftpd seine Meldungen schreibt. Diese Datei wird für den Benutzer 'nobody' und die Gruppe 'nogroup' mit Lese-Schreibzugriff zur Verfügung gestellt werden.
fr: Fichier dans lequel les informations seront enregistrées. Ce fichier sera modifiable par l'utilisateur « nobody » et le groupe « nogroup ».

source: Base directory.
de: Stammverzeichnis.
fr: Répertoire racine.

source: The directory tree from where atftpd can serve files. That directory must be world readable.
de: Der Verzeichnisbaum, in dem atftpd Dateien zur Verfügung stellen kann. Dieses Verzeichnis muss für alle Benutzer lesbar sein.
fr: Le répertoire à partir duquel atftpd sert les fichiers. Ce répertoire doit pouvoir être lu par tous.
